rails/modulo_3/projeto_teste/app/controllers/type_users_controller.rb

  def index
    @type_users = TypeUser.all
---
SELECT "type_users".* FROM "type_users"