rails/modulo_3/projeto_teste/app/controllers/users_controller.rb

SELECT "type_users".* FROM "type_users"
SELECT "users".* FROM "users"
---
  def index
    @users = User.all

INSERT INTO "users" ("first_name", "last_name", "age", "cpf", "created_at", "updated_at", "telephone", "type_user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "updated_at" = ?, "type_user_id" = ? WHERE "users"."id" = ?  [["updated_at", "2022-09-21 20:59:47.135688"], ["type_user_id", 2], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

SELECT "type_users".* FROM "type_users" WHERE "type_users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_user
      @user = User.find(params[:id])

SELECT "type_users"."description_name", "type_users"."id" FROM "type_users"
---
    def set_type_user_options
      @type_users_options = TypeUser.all.pluck(:description_name, :id)