rails/modulo_3/projeto_teste/lib/tasks/dev.rake

SELECT "type_users".* FROM "type_users" WHERE "type_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."first_name" = ? AND "users"."last_name" = ? AND "users"."age" = ? AND "users"."cpf" = ? AND "users"."type_user_id" = ? LIMIT ?  [["first_name", "Francisco"], ["last_name", "Farias"], ["age", 21], ["cpf", 53564451803], ["type_user_id", 1], ["LIMIT", 1]]
SELECT "type_users".* FROM "type_users" WHERE "type_users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "type_users".* FROM "type_users" WHERE "type_users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "users" ("first_name", "last_name", "age", "cpf", "created_at", "updated_at", "type_user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  task add_users: :environment do
    show_spinner("Cadastrando Moedas") do
      users = [
        {
          first_name: "Francisco",
          last_name: "Farias",
          age: 21,
          cpf: 53564451803,
          type_user: TypeUser.find_by(id: 1)
        },
        {
          first_name: "Josinete",
          last_name: "Farias",
          age: 52,
          cpf: 92400833400,
          type_user: TypeUser.find_by(id: 2)
        },
        {
          first_name: "Joyce",
          last_name: "Guimarães",
          age: 21,
          cpf: 50244342857,
          type_user: TypeUser.find_by(id: 3)
        }
      ]
      users.each { |user| User.find_or_create_by!(user) }

INSERT INTO "type_users" ("description_name", "criar", "atualizar", "deletar", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["description_name", "Administrador"], ["criar", 1], ["atualizar", 1], ["deletar", 1], ["created_at", "2022-09-21 13:50:56.114364"], ["updated_at", "2022-09-21 13:50:56.114364"]]
---
  task add_typeUsers: :environment do
    show_spinner("Cadastrando tipos de usuários") do
      typeUsers = [
        {
          description_name: "Administrador",
          criar: true,
          atualizar: true,
          deletar: true,
          visualizar: true
        },
        {
          description_name: "Colaborador",
          criar: true,
          atualizar: true,
          deletar: false,
          visualizar: true
        },
        {
          description_name: "Visitante",
          criar: false,
          atualizar: false,
          deletar: false,
          visualizar: true
        },
      ]
      typeUsers.each {|typeUser| TypeUser.find_or_create_by!(typeUser)}